#include <stdio.h>

int main()
{   
    //Масив А в який записуватимемо щасливі квитки.
    //Змінна a – це номер квитка.
    //Задаємо змінні sum1 і sum2 в яких буде зберігатися суми першої і другої пари чисел. 
    //Змінні n1, n2, n3, n4 зберігатимуть по одному числу з номера квитка. 
    //Змінна n – це кількість щасливих квитків.
    int A[9999],a,sum1,sum2,n1,n2,n3,n4,n,i;
    a = 1000;
    n = 0;
    
    //Цикл перевіряє всі квитки від a до 9999
    while( a <= 9999)
    {
        
        //Розбиваємо номер квитка на 4 числа
        n1 = a/1000;
        n2 = (a/100)%10;
        n3 = (a/10)%10;
        n4 = a%10;
        
        //Дізнаємось суму першої пари чисел і другої
        sum1 = n1 + n2;
        sum2 = n3 + n4;
        
        //Якщо сума першої пари дорівнює сумі другої, то записуємо цей квиток у масив і додаємо 1 до кількості щасливих квитків(n).
        if(sum1 == sum2)
        {
          A[n] = a;
          n++;
        }
        
        a++;
    }
     
    return 0;
    
}
